micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
  uint32_t WindowY0;                   /*!< Configures the Window vertical Start Position.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0x7FF. */

  uint32_t WindowY1;                   /*!< Configures the Window vertical Stop Position.
                                            This parameter must be a number between
                                            Min_Data = 0x0000 and Max_Data = 0x7FF. */

  uint32_t PixelFormat;                /*!< Specifies the pixel format.
                                            This parameter can be one of value of @ref LTDC_Pixelformat */

  uint32_t Alpha;                      /*!< Specifies the constant alpha used for blending.
                                            This parameter must be a number between
                                            Min_Data = 0x00 and Max_Data = 0xFF. */

  uint32_t Alpha0;                     /*!< Configures the default alpha value.
                                            This parameter must be a number between
                                            Min_Data = 0x00 and Max_Data = 0xFF. */

  uint32_t BlendingFactor1;            /*!< Select the blending factor 1.
                                            This parameter can be one of value of @ref LTDC_BlendingFactor1 */

  uint32_t BlendingFactor2;            /*!< Select the blending factor 2.
                                            This parameter can be one of value of @ref LTDC_BlendingFactor2 */

  uint32_t FBStartAdress;              /*!< Configures the color frame buffer address */

  uint32_t ImageWidth;                 /*!< Configures the color frame buffer line length.
                                            This parameter must be a number between
                                            Min_Data = 0x0000 and Max_Data = 0x1FFF. */

  uint32_t ImageHeight;                /*!< Specifies the number of line in frame buffer.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0x7FF. */

  LTDC_ColorTypeDef   Backcolor;       /*!< Configures the layer background color. */
} LTDC_LayerCfgTypeDef;

/**
  * @brief  LTDC Flexible Layer structure definition
  */
typedef struct
{
  uint32_t WindowX0;                   /*!< Configures the Window Horizontal Start Position.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0xFFF. */

  uint32_t WindowX1;                   /*!< Configures the Window Horizontal Stop Position.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0xFFF. */

  uint32_t WindowY0;                   /*!< Configures the Window vertical Start Position.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0x7FF. */

  uint32_t WindowY1;                   /*!< Configures the Window vertical Stop Position.
                                            This parameter must be a number between
                                            Min_Data = 0x0000 and Max_Data = 0x7FF. */

  uint32_t Alpha;                      /*!< Specifies the constant alpha used for blending.
                                            This parameter must be a number between
                                            Min_Data = 0x00 and Max_Data = 0xFF. */

  uint32_t Alpha0;                     /*!< Configures the default alpha value.
                                            This parameter must be a number between
                                            Min_Data = 0x00 and Max_Data = 0xFF. */

  uint32_t BlendingFactor1;            /*!< Select the blending factor 1.
                                            This parameter can be one of value of @ref LTDC_BlendingFactor1 */

  uint32_t BlendingFactor2;            /*!< Select the blending factor 2.
                                            This parameter can be one of value of @ref LTDC_BlendingFactor2 */

  uint32_t ImageWidth;                 /*!< Configures the color frame buffer line length.
                                            This parameter must be a number between
                                            Min_Data = 0x0000 and Max_Data = 0x1FFF. */

  uint32_t ImageHeight;                /*!< Specifies the number of line in frame buffer.
                                            This parameter must be a number between
                                            Min_Data = 0x000 and Max_Data = 0x7FF. */

  LTDC_ColorTypeDef   Backcolor;       /*!< Configures the layer background color. */
} LTDC_LayerTypeDef;

/**
  * @brief  LTDC Flexible ARGB format structure definition
  */
typedef struct
{
  uint32_t PixelSize;          /*!< Value of ARGB Pixel size. Could be a value of LTDC_ARGB_SIZE
                                  This parameter can be one of value of @ref LTDC_ARGB_SIZE                     */

  uint32_t AlphaPos;           /*!< Position of the Alpha component inside the pixel memory word (in bits)
                                  This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x1F. */

  uint32_t RedPos;             /*!< Position of the Red component inside the pixel memory word (in bits)
                                  This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x1F. */

  uint32_t GreenPos;           /*!< Position of the Green component inside the pixel memory word (in bits)
                                  This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x1F. */

  uint32_t BluePos;            /*!< Position of the Blue component inside the pixel memory word (in bits)
                                  This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xF.   */

  uint32_t AlphaWidth;         /*!< Width of the Alpha component in bits
                                  This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xF.   */

  uint32_t RedWidth;           /*!< Width of the Red component in bits
                                  This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xF.   */

  uint32_t GreenWidth;         /*!< Width of the Green component in bits
                                  This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xF.   */

  uint32_t BlueWidth;          /*!< Width of the Blue component in bits
                                  This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xF.   */
} LTDC_FlexARGBTypeDef;

/**
  * @brief  LTDC Layer Flexible ARGB format structure definition
  */
typedef struct
{
  LTDC_LayerTypeDef Layer;          /*!< Pointer to LTDC_LayerTypeDef structure     */
  LTDC_FlexARGBTypeDef FlexARGB;    /*!< Pointer to LTDC_FlexARGBTypeDef structure  */
  uint32_t ARGBAddress;              /*!< Configures the color frame buffer address  */
} LTDC_LayerFlexARGBTypeDef;

/**
  * @brief  LTDC Flexible YUV format structure definition
  */
typedef struct
{
  uint32_t YUVOrder;             /*!< Y/UV order.
                                      This parameter can be one of value of @ref LTDC_YUV_ORDER        */

  uint32_t LuminanceOrder;       /*!< Y1/Y2 order.
                                      This parameter can be one of value of @ref LTDC_LUMINANCE_ORDER  */

