micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
  uint32_t ChrominanceOrder;     /*!< U/V order.
                                      This parameter can be one of value of @ref LTDC_CHROMINANCE_ORDER */

  uint32_t LuminanceRescale;     /*!< Enable or disable luminance rescale.
                                      This parameter can be one of value of @ref LTDC_LUMINANCE_RANGE   */
} LTDC_FlexYUVTypeDef;

/**
  * @brief  LTDC Flexible YUV coplanar structure definition
  */
typedef struct
{
  LTDC_LayerTypeDef Layer;             /*!< Pointer to LTDC_LayerTypeDef structure                           */

  LTDC_FlexYUVTypeDef FlexYUV;         /*!< Pointer to LTDC_FlexYUVTypeDef structure                         */

  uint32_t YUVAddress;                        /*!< YUV Frame Buffer address                                         */

  uint32_t ColorConverter;                    /*!< Configure the YUV to RGB conversion.
                                                   This parameter can be one of value of @ref LTDC_YUV2RGBCONVERTOR */
} LTDC_LayerFlexYUVCoPlanarTypeDef;

/**
  * @brief  LTDC YUV Semiplanar addresses structure definition
  */
typedef struct
{
  uint32_t YAddress;     /*!< Y Frame Buffer address  */
  uint32_t UVAddress;    /*!< UV Frame Buffer address */
} LTDC_YUVSemiPlanarAddressTypeDef;

/**
  * @brief  LTDC YUV Fullplanar addresses structure definition
  */
typedef struct
{
  uint32_t YAddress;    /*!< Y Frame Buffer address */
  uint32_t UAddress;    /*!< U Frame Buffer address */
  uint32_t VAddress;    /*!< V Frame Buffer address */
} LTDC_YUVFullPlanarAddressTypeDef;

/**
  * @brief  LTDC Layer Flexible YUV semi Planar structure definition
  */
typedef struct
{
  LTDC_LayerTypeDef Layer;                                  /*!< Pointer to LTDC_LayerTypeDef              */
  LTDC_FlexYUVTypeDef FlexYUV;                              /*!< Pointer LTDC_FlexYUVTypeDef               */
  LTDC_YUVSemiPlanarAddressTypeDef YUVSemiPlanarAddress;    /*!< Pointer LTDC_YUVSemiPlanarAddressTypeDef  */
  uint32_t ColorConverter;                                    /*!< Configure the YUV to RGB conversion.
                                                                  This parameter can be one of value
                                                                  of @ref LTDC_YUV2RGBCONVERTOR              */
} LTDC_LayerFlexYUVSemiPlanarTypeDef;

/**
  * @brief  LTDC Layer Flexible YUV full Planar structure definition
  */
typedef struct
{
  LTDC_LayerTypeDef Layer;                                  /*!< Pointer to LTDC_LayerTypeDef              */
  LTDC_FlexYUVTypeDef FlexYUV;                              /*!< Pointer LTDC_FlexYUVTypeDef               */
  LTDC_YUVFullPlanarAddressTypeDef YUVFullPlanarAddress;    /*!< Pointer LTDC_YUVFullPlanarAddressTypeDef  */
  uint32_t ColorConverter;                                    /*!< Configure the YUV to RGB conversion.
                                                                   This parameter can be one of value
                                                                   of @ref LTDC_YUV2RGBCONVERTOR              */
} LTDC_LayerFlexYUVFullPlanarTypeDef;

/**
  * @brief  HAL LTDC State structures definition
  */
typedef enum
{
  HAL_LTDC_STATE_RESET             = 0x00U,    /*!< LTDC not yet initialized or disabled */
  HAL_LTDC_STATE_READY             = 0x01U,    /*!< LTDC initialized and ready for use   */
  HAL_LTDC_STATE_BUSY              = 0x02U,    /*!< LTDC internal process is ongoing     */
  HAL_LTDC_STATE_TIMEOUT           = 0x03U,    /*!< LTDC Timeout state                   */
  HAL_LTDC_STATE_ERROR             = 0x04U     /*!< LTDC state error                     */
} HAL_LTDC_StateTypeDef;

/**
  * @brief  LTDC handle Structure definition
  */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
typedef struct __LTDC_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */
{
  LTDC_TypeDef                *Instance;                /*!< LTDC Register base address                */

  LTDC_InitTypeDef            Init;                     /*!< LTDC parameters                           */

  LTDC_LayerCfgTypeDef        LayerCfg[MAX_LAYER];      /*!< LTDC Layers parameters                    */

  HAL_LockTypeDef             Lock;                     /*!< LTDC Lock                                 */

  __IO HAL_LTDC_StateTypeDef  State;                    /*!< LTDC state                                */

  __IO uint32_t               ErrorCode;                /*!< LTDC Error code                           */

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
  void (* LineEventCallback)(struct __LTDC_HandleTypeDef *hltdc);     /*!< LTDC Line Event Callback    */
  void (* ReloadEventCallback)(struct __LTDC_HandleTypeDef *hltdc);   /*!< LTDC Reload Event Callback  */
  void (* ErrorCallback)(struct __LTDC_HandleTypeDef *hltdc);         /*!< LTDC Error Callback         */
  void (* WarningEventCallback)(struct __LTDC_HandleTypeDef *hltdc);  /*!< LTDC Warning Event          */

  void (* MspInitCallback)(struct __LTDC_HandleTypeDef *hltdc);       /*!< LTDC Msp Init callback      */
  void (* MspDeInitCallback)(struct __LTDC_HandleTypeDef *hltdc);     /*!< LTDC Msp DeInit callback    */

#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */


} LTDC_HandleTypeDef;

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL LTDC Callback ID enumeration definition
  */
typedef enum
{
  HAL_LTDC_MSPINIT_CB_ID            = 0x00U,    /*!< LTDC MspInit callback ID       */
  HAL_LTDC_MSPDEINIT_CB_ID          = 0x01U,    /*!< LTDC MspDeInit callback ID     */

  HAL_LTDC_LINE_EVENT_CB_ID         = 0x02U,    /*!< LTDC Line Event Callback ID    */
  HAL_LTDC_RELOAD_EVENT_CB_ID       = 0x03U,    /*!< LTDC Reload Callback ID        */
  HAL_LTDC_WARNING_EVENT_CB_ID      = 0x08U,    /*!< LTDC Warning Event Callback ID */
  HAL_LTDC_ERROR_CB_ID              = 0x04U     /*!< LTDC Error Callback ID         */

} HAL_LTDC_CallbackIDTypeDef;

/**
  * @brief  HAL LTDC Callback pointer definition
  */
typedef  void (*pLTDC_CallbackTypeDef)(LTDC_HandleTypeDef *hltdc);  /*!< pointer to an LTDC callback function */

