micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup LTDC_Exported_Constants LTDC Exported Constants
  * @{
  */

/** @defgroup LTDC_Error_Code LTDC Error Code
  * @{
  */
#define HAL_LTDC_ERROR_NONE               0x00000000U   /*!< LTDC No error             */
#define HAL_LTDC_ERROR_TE                 0x00000001U   /*!< LTDC Transfer error       */
#define HAL_LTDC_ERROR_FU                 0x00000002U   /*!< LTDC FIFO Underrun        */
#define HAL_LTDC_ERROR_CRC                0x00000004U   /*!< LTDC CRC error            */
#define HAL_LTDC_ERROR_TIMEOUT            0x00000020U   /*!< LTDC Timeout error        */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
#define  HAL_LTDC_ERROR_INVALID_CALLBACK  0x00000040U   /*!< LTDC Invalid Callback error  */
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup LTDC_Layer LTDC Layer
  * @{
  */
#define LTDC_LAYER_1                      0U       /*!< LTDC Layer 1 */
#define LTDC_LAYER_2                      1U       /*!< LTDC Layer 2 */
/**
  * @}
  */

/** @defgroup LTDC_HS_POLARITY LTDC HS POLARITY
  * @{
  */
#define LTDC_HSPOLARITY_AL                0U                    /*!< Horizontal Synchronization is active low. */
#define LTDC_HSPOLARITY_AH                LTDC_GCR_HSPOL        /*!< Horizontal Synchronization is active high. */
/**
  * @}
  */

/** @defgroup LTDC_VS_POLARITY LTDC VS POLARITY
  * @{
  */
#define LTDC_VSPOLARITY_AL                0U                    /*!< Vertical Synchronization is active low. */
#define LTDC_VSPOLARITY_AH                LTDC_GCR_VSPOL        /*!< Vertical Synchronization is active high. */
/**
  * @}
  */

/** @defgroup LTDC_DE_POLARITY LTDC DE POLARITY
  * @{
  */
#define LTDC_DEPOLARITY_AL                0U                    /*!< Data Enable, is active low. */
#define LTDC_DEPOLARITY_AH                LTDC_GCR_DEPOL        /*!< Data Enable, is active high. */
/**
  * @}
  */

/** @defgroup LTDC_PC_POLARITY LTDC PC POLARITY
  * @{
  */
#define LTDC_PCPOLARITY_IPC               0U                    /*!< input pixel clock. */
#define LTDC_PCPOLARITY_IIPC              LTDC_GCR_PCPOL        /*!< inverted input pixel clock. */
/**
  * @}
  */

/** @defgroup LTDC_SYNC LTDC SYNC
  * @{
  */
#define LTDC_HORIZONTALSYNC               (LTDC_SSCR_HSW >> 16U)    /*!< Horizontal synchronization width. */
#define LTDC_VERTICALSYNC                 LTDC_SSCR_VSH             /*!< Vertical synchronization height. */
/**
  * @}
  */

/** @defgroup LTDC_BACK_COLOR LTDC BACK COLOR
  * @{
  */
#define LTDC_COLOR                        0x000000FFU   /*!< Color mask */
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor1 LTDC Blending Factor1
  * @{
  */
#define LTDC_BLENDING_FACTOR1_CA          0x00000400U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR1_PAxCA       0x00000600U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor2 LTDC Blending Factor2
  * @{
  */
#define LTDC_BLENDING_FACTOR2_CA          0x00000005U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR2_PAxCA       0x00000007U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_Pixelformat LTDC Pixel format
  * @{
  */
#define LTDC_PIXEL_FORMAT_ARGB8888     0x0U             /*!< ARGB8888 LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_ABGR8888     0x1U             /*!< ABGR888  LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_RGBA8888     0x2U             /*!< RGBA888  LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_BGRA8888     0x3U             /*!< BGRA8888 LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_RGB565       0x4U             /*!< RGB565   LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_BGR565       0x5U             /*!< BGR565   LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_RGB888       0x6U             /*!< RGB888   LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_ARGB1555     0x7U             /*!< ARGB1555 LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_ARGB4444     0x8U             /*!< ARGB4444 LTDC pixel format*/
#define LTDC_PIXEL_FORMAT_L8           0x9U             /*!< L8 LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_AL44         0xAU             /*!< AL44 LTDC pixel format    */
#define LTDC_PIXEL_FORMAT_AL88         0xBU             /*!< AL88 LTDC pixel format    */
/**
  * @}
  */

/** @defgroup LTDC_Mirror LTDC Mirror Configuration
  * @{
  */
#define LTDC_MIRROR_HORIZONTAL                       0U       /*!< Enable Horizontal Mirroring                  */
#define LTDC_MIRROR_VERTICAL                         1U       /*!< Enable Vertical Mirroring                    */
#define LTDC_MIRROR_HORIZONTAL_VERTICAL              2U       /*!< Enable Horizontal and vertical Mirroring     */
#define LTDC_MIRROR_NONE                             3U       /*!< Disable Horizontal and vertical Mirroring    */
/**
  * @}
  */

/** @defgroup LTDC_ARGB_SIZE LTDC ARGB pixel size in bytes
  * @{
  */
#define LTDC_ARGB_PIXEL_SIZE_1_BYTE      1U       /*!<Custom ARGB with 1 byte per pixel          */
#define LTDC_ARGB_PIXEL_SIZE_2_BYTES     2U       /*!<Custom ARGB with 2 bytes per pixel         */
#define LTDC_ARGB_PIXEL_SIZE_3_BYTES     3U       /*!<Custom ARGB with 3 bytes per pixel         */
#define LTDC_ARGB_PIXEL_SIZE_4_BYTES     4U       /*!<Custom ARGB with 4 bytes per pixel         */
/**
  * @}
  */

/** @defgroup LTDC_YUV_ORDER LTDC YUV order from LSB
  * @{
  */
#define LTDC_YUV_ORDER_LUMINANCE_FIRST   LTDC_LxPCR_YF     /*!<Luminance component first            */
#define LTDC_YUV_ORDER_CHROMINANCE_FIRST 0U                /*!<Chrominance component (U or V) first */
/**
  * @}
  */

/** @defgroup LTDC_CHROMINANCE_ORDER LTDC chrominance order from LSB
  * @{
  */
#define LTDC_YUV_CHROMIANCE_ORDER_U_FIRST   LTDC_LxPCR_CBF    /*!<Chrominance order U first  */
#define LTDC_YUV_CHROMIANCE_ORDER_V_FIRST   0U                /*!<Chrominance order V first  */
/**
  * @}
  */

