micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
/** @defgroup LTDC_LUMINANCE_ORDER LTDC luminance order from LSB
  * @{
  */
#define LTDC_YUV_LUMINANCE_ORDER_ODD_FIRST   LTDC_LxPCR_OF     /*!<Lumiance order Y1 then Y2    */
#define LTDC_YUV_LUMINANCE_ORDER_EVEN_FIRST  0U                /*!<Luminance order Y2 then Y1   */
/**
  * @}
  */

/** @defgroup LTDC_LUMINANCE_RANGE LTDC luminance range
  * @{
  */
#define LTDC_YUV_LUMINANCE_RESCALE_ENABLE    LTDC_LxPCR_YREN   /*!< Rescale Luminance from [16-235] to [0-255] */
#define LTDC_YUV_LUMINANCE_RESCALE_DISABLE   0U                /*!< Luminance provided in range [0-255]        */
/**
  * @}
  */

/** @defgroup LTDC_BLENDING_ORDER LTDC layers blending order
  * @{
  */
#define LTDC_BLENDING_ORDER_FOREGROUND    LTDC_LxBFCR_BOR   /*!<Layer set to Foreground during blending */
#define LTDC_BLENDING_ORDER_BACKGROUND    0U                /*!<Layer set to Background during blending  */
/**
  * @}
  */

/** @defgroup LTDC_RGB_COMPONENT LTDC RGB component
  * @{
  */
#define LTDC_RGB_COMPONENT_RED   LTDC_GCCR_REN                                   /*!<Red component                   */
#define LTDC_RGB_COMPONENT_GREEN LTDC_GCCR_GEN                                   /*!<Green component                 */
#define LTDC_RGB_COMPONENT_BLUE  LTDC_GCCR_BEN                                   /*!<Blue component                  */
#define LTDC_RGB_COMPONENT_ALL   (LTDC_GCCR_REN | LTDC_GCCR_GEN | LTDC_GCCR_BEN) /*!<Red, Blue and Green components  */
/**
  * @}
  */

/** @defgroup LTDC_DISPLAY LTDC Display
  * @{
  */
#define LTDC_OUT_RGB       0U                                                       /*!< Select RGB as output format (default)    */
#define LTDC_OUT_YUV_HDTV  (LTDC_EDCR_OCYEN  | LTDC_EDCR_OCYSEL)                    /*!< RGB converted to YUV using ITU-R BT.709  */
#define LTDC_OUT_YUV_SDTV  LTDC_EDCR_OCYEN                                          /*!< RGB converted to YUV using ITU-R BT.601  */
#define LTDC_OUT_YVU_HDTV  (LTDC_EDCR_OCYEN | LTDC_EDCR_OCYSEL | LTDC_EDCR_OCYCO)   /*!< RGB converted to YVU using ITU-R BT.709  */
#define LTDC_OUT_YVU_SDTV  (LTDC_EDCR_OCYEN | LTDC_EDCR_OCYCO)                      /*!< RGB converted to YVU using ITU-R BT.601  */


/**
  * @}
  */
/** @defgroup LTDC_YUV2RGBCONVERTOR LTDC YUV to RGB color convertor
  * @{
 */
#define LTDC_YUV2RGBCONVERTOR_BT601_REDUCED_RANGE  0U                /*!< Select ITU-R BT.601 as output format      */
#define LTDC_YUV2RGBCONVERTOR_BT709_REDUCED_RANGE  1U                /*!< Select ITU-R BT.709 as output format      */
#define LTDC_YUV2RGBCONVERTOR_BT601_FULL_RANGE     2U                /*!< Select RGB as output format               */
#define LTDC_YUV2RGBCONVERTOR_BT709_FULL_RANGE     3U                /*!< Select RGB as output format               */
/**
  * @}
  */

/** @defgroup LTDC_Alpha LTDC Alpha
  * @{
  */
#define LTDC_ALPHA                        LTDC_LxCACR_CONSTA        /*!< LTDC Constant Alpha mask */
/**
  * @}
  */

/** @defgroup LTDC_LAYER_Config LTDC LAYER Config
  * @{
  */
#define LTDC_STOPPOSITION                 (LTDC_LxWHPCR_WHSPPOS >> 16U) /*!< LTDC Layer stop position  */
#define LTDC_STARTPOSITION                LTDC_LxWHPCR_WHSTPOS          /*!< LTDC Layer start position */

#define LTDC_COLOR_FRAME_BUFFER           LTDC_LxCFBLR_CFBLL            /*!< LTDC Layer Line length    */
#define LTDC_LINE_NUMBER                  LTDC_LxCFBLNR_CFBLNBR         /*!< LTDC Layer Line number    */
/**
  * @}
  */

/** @defgroup LTDC_Interrupts LTDC Interrupts
  * @{
  */
#define LTDC_IT_LI                        LTDC_IER_LIE              /*!< LTDC Line Interrupt                  */
#define LTDC_IT_FU                        LTDC_IER_FUIE             /*!< LTDC FIFO Underrun Interrupt         */
#define LTDC_IT_TE                        LTDC_IER_TERRIE           /*!< LTDC Transfer Error Interrupt        */
#define LTDC_IT_RR                        LTDC_IER_RRIE             /*!< LTDC Register Reload Interrupt       */
#define LTDC_IT_CRC                       LTDC_IER_CRCIE            /*!< LTDC CRC error Interrupt             */
#define LTDC_IT_FUW                       LTDC_IER_FUWIE            /*!< LTDC FIFO Warning Underrun Interrupt */
/**
  * @}
  */

/** @defgroup LTDC_Flags LTDC Flags
  * @{
  */
#define LTDC_FLAG_LI                      LTDC_ISR_LIF              /*!< LTDC Line Interrupt Flag             */
#define LTDC_FLAG_FU                      LTDC_ISR_FUIF             /*!< LTDC FIFO Underrun interrupt Flag    */
#define LTDC_FLAG_TE                      LTDC_ISR_TERRIF           /*!< LTDC Transfer Error interrupt Flag   */
#define LTDC_FLAG_RR                      LTDC_ISR_RRIF             /*!< LTDC Register Reload interrupt Flag  */
#define LTDC_FLAG_CRC                     LTDC_ISR_CRCIF            /*!< LTDC CRC error Interrupt             */
#define LTDC_FLAG_FUW                     LTDC_ISR_FUWIF            /*!< LTDC FIFO Warning Underrun Interrupt */
/**
  * @}
  */

/** @defgroup LTDC_Reload_Type LTDC Reload Type
  * @{
  */
#define LTDC_RELOAD_IMMEDIATE             LTDC_SRCR_IMR             /*!< Immediate Reload */
#define LTDC_RELOAD_VERTICAL_BLANKING     LTDC_SRCR_VBR             /*!< Vertical Blanking Reload */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup LTDC_Exported_Macros LTDC Exported Macros
  * @{
  */

/** @brief Reset LTDC handle state.
  * @param  __HANDLE__  LTDC handle
  * @retval None
  */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
#define __HAL_LTDC_RESET_HANDLE_STATE(__HANDLE__) do{                                                 \
                                                      (__HANDLE__)->State = HAL_LTDC_STATE_RESET;     \
                                                      (__HANDLE__)->MspInitCallback = NULL;           \
                                                      (__HANDLE__)->MspDeInitCallback = NULL;         \
                                                    } while(0)
#else
#define __HAL_LTDC_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_LTDC_STATE_RESET)
#endif /*USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @brief  Enable the LTDC.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_ENABLE(__HANDLE__)    ((__HANDLE__)->Instance->GCR |= LTDC_GCR_LTDCEN)

/**
  * @brief  Disable the LTDC.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_DISABLE(__HANDLE__)   ((__HANDLE__)->Instance->GCR &= ~(LTDC_GCR_LTDCEN))

/**
  * @brief  Enable the LTDC Layer.
  * @param  __HANDLE__  LTDC handle
  * @param  __LAYER__   Specify the layer to be enabled.
  *                     This parameter can be LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1).
  * @retval None.
  */
#define __HAL_LTDC_LAYER_ENABLE(__HANDLE__, __LAYER__)  ((LTDC_LAYER((__HANDLE__), (__LAYER__)))->CR\
                                                         |= (uint32_t)LTDC_LxCR_LEN)

/**
  * @brief  Disable the LTDC Layer.
  * @param  __HANDLE__  LTDC handle
  * @param  __LAYER__   Specify the layer to be disabled.
  *                     This parameter can be LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1).
  * @retval None.
  */
#define __HAL_LTDC_LAYER_DISABLE(__HANDLE__, __LAYER__) ((LTDC_LAYER((__HANDLE__), (__LAYER__)))->CR\
                                                         &= ~(uint32_t)LTDC_LxCR_LEN)

/**
  * @brief  Reload immediately all LTDC Layers.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(__HANDLE__)  ((__HANDLE__)->Instance->SRCR |= LTDC_SRCR_IMR)

/**
  * @brief  Reload during vertical blanking period all LTDC Layers.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_VERTICAL_BLANKING_RELOAD_CONFIG(__HANDLE__)  ((__HANDLE__)->Instance->SRCR |= LTDC_SRCR_VBR)

/* Interrupt & Flag management */
/**
  * @brief  Get the LTDC pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Get the specified flag.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_CRC: LTDC CRC error interrupt flag
  *            @arg LTDC_FLAG_FUW: FIFO Warning Underrun interrupt flag
  * @retval The state of FLAG (SET or RESET).
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define __HAL_LTDC_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR2 & (__FLAG__))
#else
#define __HAL_LTDC_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR & (__FLAG__))
#endif /* __ARM_FEATURE_CMSE & __ARM_FEATURE_CMSE == 3U */

/**
  * @brief  Clears the LTDC pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Specify the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_CRC: LTDC CRC error Interrupt flag
  *            @arg LTDC_FLAG_FUW: FIFO Warning Underrun Interrupt flag
  * @retval None
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define __HAL_LTDC_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR2 = (__FLAG__))
#else
#define __HAL_LTDC_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR = (__FLAG__))
#endif /* __ARM_FEATURE_CMSE & __ARM_FEATURE_CMSE == 3U */

/**
  * @brief  Enables the specified LTDC interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be enabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_CRC: LTDC CRC error Interrupt
  *            @arg LTDC_IT_FUW: FIFO Warning Underrun Interrupt
  * @retval None
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define __HAL_LTDC_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 |= (__INTERRUPT__))
#else
#define __HAL_LTDC_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER |= (__INTERRUPT__))
#endif /* __ARM_FEATURE_CMSE & __ARM_FEATURE_CMSE == 3U */

/**
  * @brief  Disables the specified LTDC interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be disabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_CRC: LTDC CRC error Interrupt
  *            @arg LTDC_IT_FUW: FIFO Underrun Warning Interrupt
  * @retval None
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define __HAL_LTDC_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 &= ~(__INTERRUPT__))
#else
#define __HAL_LTDC_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER &= ~(__INTERRUPT__))
#endif /* __ARM_FEATURE_CMSE & __ARM_FEATURE_CMSE == 3U */

/**
  * @brief  Check whether the specified LTDC interrupt has occurred or not.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_CRC: LTDC CRC error Interrupt
  *            @arg LTDC_IT_FUW: FIFO Underrun Warning Interrupt
  * @retval The state of INTERRUPT (SET or RESET).
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define __HAL_LTDC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 & (__INTERRUPT__))
#else
#define __HAL_LTDC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER & (__INTERRUPT__))
#endif /* __ARM_FEATURE_CMSE & __ARM_FEATURE_CMSE == 3U */
/**
  * @}
  */

/* Include LTDC HAL Extension module */
#include "stm32n6xx_hal_ltdc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup LTDC_Exported_Functions
  * @{
  */
/** @addtogroup LTDC_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
HAL_StatusTypeDef HAL_LTDC_Init(LTDC_HandleTypeDef *hltdc);
HAL_StatusTypeDef HAL_LTDC_DeInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_ErrorCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_LineEventCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_WarningEventCallback(LTDC_HandleTypeDef *hltdc);

/* Burst length function *****************************/
HAL_StatusTypeDef HAL_LTDC_ConfigBurstLength(LTDC_HandleTypeDef *hltdc, uint32_t BurstLength, uint32_t LayerIdx);

/* Underrun threshold function *****************************/
HAL_StatusTypeDef HAL_LTDC_ConfigUnderrunThreshold(LTDC_HandleTypeDef *hltdc, uint16_t Threshold);

/* Mirroring functions *****************************/
HAL_StatusTypeDef HAL_LTDC_ConfigMirror(LTDC_HandleTypeDef *hltdc, uint32_t Mirror, uint32_t LayerIdx);

/* Callbacks Register/UnRegister functions  ***********************************/
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
HAL_StatusTypeDef HAL_LTDC_RegisterCallback(LTDC_HandleTypeDef *hltdc, HAL_LTDC_CallbackIDTypeDef CallbackID,
                                            pLTDC_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_LTDC_UnRegisterCallback(LTDC_HandleTypeDef *hltdc, HAL_LTDC_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @}
  */

