micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup LTDC_Private_Macros LTDC Private Macros
  * @{
  */
#define LTDC_LAYER(__HANDLE__, __LAYER__)              ((LTDC_Layer_TypeDef *)((uint32_t)(\
                                                                               ((uint32_t)((__HANDLE__)->Instance))\
                                                                               + 0x100U + (0x100U*(__LAYER__)))))

#define IS_LTDC_LAYER(__LAYER__)                       ((__LAYER__) < MAX_LAYER)
#define IS_LTDC_PLANAR_LAYER(__LAYER__)                ((__LAYER__) == LTDC_LAYER_1)
#define IS_LTDC_HSPOL(__HSPOL__)                       (((__HSPOL__) == LTDC_HSPOLARITY_AL)\
                                                        || ((__HSPOL__) == LTDC_HSPOLARITY_AH))
#define IS_LTDC_VSPOL(__VSPOL__)                       (((__VSPOL__) == LTDC_VSPOLARITY_AL)\
                                                        || ((__VSPOL__) == LTDC_VSPOLARITY_AH))
#define IS_LTDC_DEPOL(__DEPOL__)                       (((__DEPOL__) == LTDC_DEPOLARITY_AL)\
                                                        || ((__DEPOL__) ==  LTDC_DEPOLARITY_AH))
#define IS_LTDC_PCPOL(__PCPOL__)                       (((__PCPOL__) == LTDC_PCPOLARITY_IPC)\
                                                        || ((__PCPOL__) ==  LTDC_PCPOLARITY_IIPC))
#define IS_LTDC_HSYNC(__HSYNC__)                       ((__HSYNC__)  <= LTDC_HORIZONTALSYNC)
#define IS_LTDC_VSYNC(__VSYNC__)                       ((__VSYNC__)  <= LTDC_VERTICALSYNC)
#define IS_LTDC_AHBP(__AHBP__)                         ((__AHBP__)   <= LTDC_HORIZONTALSYNC)
#define IS_LTDC_AVBP(__AVBP__)                         ((__AVBP__)   <= LTDC_VERTICALSYNC)
#define IS_LTDC_AAW(__AAW__)                           ((__AAW__)    <= LTDC_HORIZONTALSYNC)
#define IS_LTDC_AAH(__AAH__)                           ((__AAH__)    <= LTDC_VERTICALSYNC)
#define IS_LTDC_TOTALW(__TOTALW__)                     ((__TOTALW__) <= LTDC_HORIZONTALSYNC)
#define IS_LTDC_TOTALH(__TOTALH__)                     ((__TOTALH__) <= LTDC_VERTICALSYNC)
#define IS_LTDC_BLUEVALUE(__BBLUE__)                   ((__BBLUE__)  <= LTDC_COLOR)
#define IS_LTDC_GREENVALUE(__BGREEN__)                 ((__BGREEN__) <= LTDC_COLOR)
#define IS_LTDC_REDVALUE(__BRED__)                     ((__BRED__)   <= LTDC_COLOR)
#define IS_LTDC_BLENDING_FACTOR1(__BLENDING_FACTOR1__) (((__BLENDING_FACTOR1__) == LTDC_BLENDING_FACTOR1_CA) || \
                                                        ((__BLENDING_FACTOR1__) == LTDC_BLENDING_FACTOR1_PAxCA))
#define IS_LTDC_BLENDING_FACTOR2(__BLENDING_FACTOR1__) (((__BLENDING_FACTOR1__) == LTDC_BLENDING_FACTOR2_CA) || \
                                                        ((__BLENDING_FACTOR1__) == LTDC_BLENDING_FACTOR2_PAxCA))
#define IS_LTDC_PIXEL_FORMAT(__PIXEL_FORMAT__) \
  (((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_ARGB8888)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_ABGR8888)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_RGBA8888)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_BGRA8888)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_RGB565)    || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_BGR565)    || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_RGB888)    || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_ARGB1555)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_ARGB4444)  || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_L8)        || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_AL44)      || \
   ((__PIXEL_FORMAT__) == LTDC_PIXEL_FORMAT_AL88))

#define IS_LTDC_ALPHA(__ALPHA__)                       ((__ALPHA__) <= LTDC_ALPHA)
#define IS_LTDC_HCONFIGST(__HCONFIGST__)               ((__HCONFIGST__) <= LTDC_STARTPOSITION)
#define IS_LTDC_HCONFIGSP(__HCONFIGSP__)               ((__HCONFIGSP__) <= LTDC_STOPPOSITION)
#define IS_LTDC_VCONFIGST(__VCONFIGST__)               ((__VCONFIGST__) <= LTDC_STARTPOSITION)
#define IS_LTDC_VCONFIGSP(__VCONFIGSP__)               ((__VCONFIGSP__) <= LTDC_STOPPOSITION)
#define IS_LTDC_CFBP(__CFBP__)                         ((__CFBP__) <= LTDC_COLOR_FRAME_BUFFER)
#define IS_LTDC_CFBLL(__CFBLL__)                       ((__CFBLL__) <= LTDC_COLOR_FRAME_BUFFER)
#define IS_LTDC_CFBLNBR(__CFBLNBR__)                   ((__CFBLNBR__) <= LTDC_LINE_NUMBER)
#define IS_LTDC_LIPOS(__LIPOS__)                       ((__LIPOS__) <= 0x7FFU)
#define IS_LTDC_RELOAD(__RELOADTYPE__)                 (((__RELOADTYPE__) == LTDC_RELOAD_IMMEDIATE) || \
                                                        ((__RELOADTYPE__) == LTDC_RELOAD_VERTICAL_BLANKING))

#define IS_LTDC_MIRROR(__MIRROR__)         (((__MIRROR__) == LTDC_MIRROR_HORIZONTAL)           ||\
                                            ((__MIRROR__) == LTDC_MIRROR_VERTICAL)             ||\
                                            ((__MIRROR__) == LTDC_MIRROR_HORIZONTAL_VERTICAL) ||\
                                            ((__MIRROR__) == LTDC_MIRROR_NONE))

#define IS_LTDC_ARGB_SIZE(__ARGB_SIZE__)               (((__ARGB_SIZE__) == LTDC_ARGB_PIXEL_SIZE_1_BYTE)         ||\
                                                        ((__ARGB_SIZE__) == LTDC_ARGB_PIXEL_SIZE_2_BYTES)        ||\
                                                        ((__ARGB_SIZE__) == LTDC_ARGB_PIXEL_SIZE_3_BYTES)        ||\
                                                        ((__ARGB_SIZE__) == LTDC_ARGB_PIXEL_SIZE_4_BYTES))

#define IS_LTDC_ARGB_COMPONENT_POSITION(__ARGB_POS__)         ((__ARGB_POS__) <= 0x1FU)
#define IS_LTDC_ARGB_COMPONENT_WIDTH(__ARGB_WIDTH__)         ((__ARGB_WIDTH__) <= 0xFU)
#define IS_LTDC_YUV_ORDER(__YUV_ORDER__)               (((__YUV_ORDER__) == LTDC_YUV_ORDER_LUMINANCE_FIRST)      ||\
                                                        ((__YUV_ORDER__) == LTDC_YUV_ORDER_CHROMINANCE_FIRST))

