micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_ltdc.h
#define IS_LTDC_Y_ORDER(__Y_ORDER__)                 (((__Y_ORDER__) == LTDC_YUV_LUMINANCE_ORDER_ODD_FIRST)         ||\
                                                      ((__Y_ORDER__) == LTDC_YUV_LUMINANCE_ORDER_EVEN_FIRST))

#define IS_LTDC_UV_ORDER(__UV_ORDER__)                 (((__UV_ORDER__) == LTDC_YUV_CHROMIANCE_ORDER_U_FIRST)   ||\
                                                        ((__UV_ORDER__) == LTDC_YUV_CHROMIANCE_ORDER_V_FIRST))

#define IS_LTDC_Y_RANHGE(__Y_RANGE__)                 (((__Y_RANGE__) == LTDC_YUV_LUMINANCE_RESCALE_ENABLE)   ||\
                                                       ((__Y_RANGE__) == LTDC_YUV_LUMINANCE_RESCALE_DISABLE))

#define IS_LTDC_BLEND_ORDER(__BLEND_ORDER__)          (((__BLEND_ORDER__) == LTDC_BLENDING_ORDER_FOREGROUND)   ||\
                                                       ((__BLEND_ORDER__) == LTDC_BLENDING_ORDER_BACKGROUND))

#define IS_LTDC_RGB_COMPONENT(__RGB_COMPONENT__)      (((__RGB_COMPONENT__) == LTDC_RGB_COMPONENT_RED)          ||\
                                                       ((__RGB_COMPONENT__) == LTDC_RGB_COMPONENT_GREEN)        ||\
                                                       ((__RGB_COMPONENT__) == LTDC_RGB_COMPONENT_BLUE )        ||\
                                                       ((__RGB_COMPONENT__) == LTDC_RGB_COMPONENT_ALL))

#define IS_LTDC_DISPLAY(__LTDC_DISPLAY__)             (((__LTDC_DISPLAY__) == LTDC_OUT_RGB)        ||\
                                                       ((__LTDC_DISPLAY__) == LTDC_OUT_YUV_HDTV)   ||\
                                                       ((__LTDC_DISPLAY__) == LTDC_OUT_YUV_SDTV)   ||\
                                                       ((__LTDC_DISPLAY__) == LTDC_OUT_YVU_HDTV)   ||\
                                                       ((__LTDC_DISPLAY__) == LTDC_OUT_YVU_SDTV))

#define IS_LTDC_BURST_LENGTH(__BURST_LENGTH__)                       (((__BURST_LENGTH__) <= 0x10U) &&\
                                                                      ((__BURST_LENGTH__) >= 0x1U))

#define IS_LTDC_GAMMA_VALUE(__ONES__, __TENTHS__)      ((((__TENTHS__) + ((__ONES__) * 10U)) >= 4U)   &&\
                                                        (((__TENTHS__) + ((__ONES__) * 10U)) <= 29U))

#define IS_LTDC_YUV2RGBCONVERTOR(__CONVERTOR__)  (((__CONVERTOR__) == LTDC_YUV2RGBCONVERTOR_BT709_FULL_RANGE)      ||\
                                                  ((__CONVERTOR__) == LTDC_YUV2RGBCONVERTOR_BT709_REDUCED_RANGE)   ||\
                                                  ((__CONVERTOR__) == LTDC_YUV2RGBCONVERTOR_BT601_FULL_RANGE)      ||\
                                                  ((__CONVERTOR__) == LTDC_YUV2RGBCONVERTOR_BT601_REDUCED_RANGE))

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup LTDC_Private_Functions LTDC Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LTDC */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_LTDC_H */

